######################################################################
# This program is free software. It comes without any warranty, to   #
# the extent permitted by applicable law. You can redistribute it    #
# and/or modify it under the terms of the Do What The Fuck You Want  #
# To Public License, Version 2, as published by Sam Hocevar. See     #
# http://www.wtfpl.net/ for more details.                            #
######################################################################

canon = {"roman" : {'a': 'y', 'b': 'p', 'c': 'l', 'd': 't', 'e': 'a', 'f': 'v',
                    'g': 'k', 'h': 'r', 'i': 'e', 'j': 'z', 'k': 'g', 'l': 'm',
                    'm': 's', 'n': 'h', 'o': 'u', 'p': 'b', 'q': 'x', 'r': 'n',
                    's': 'c', 't': 'd', 'u': 'i', 'v': 'j', 'w': 'f', 'x': 'q',
                    'y': 'o', 'z': 'w'},

         "hiragana" : {'あ':'わ','い':'み','う':'ふ','え':'ね','お':'と',
                         'か':'あ', 'き':'ち','く':'る','け':'て','こ':'よ',
                         'さ':'ら','し':'き','す':'ぬ','せ':'へ','そ':'ほ',
                         'た':'さ','ち':'ひ','つ':'ゆ','て':'せ','と':'そ',
                         'な':'は','に':'し','ぬ':'す','ね':'め','の':'お',
                         'は':'ま','ひ':'り','ふ':'く','へ':'け','ほ':'ろ',
                         'ま':'や','み':'い','む':'つ','め':'れ','も':'こ',
                         'や':'た','ゆ':'を','よ':'も',
                         'ら':'な','り':'に','る':'う','れ':'え','ろ':'の',
                         'わ':'か','を':'む','ん':'ん',

                         'が':'だ','ぎ':'じ','ぐ':'づ','げ':'で','ご':'ぞ',
                         'ざ':'ば','じ':'ご','ず':'ぶ','ぜ':'げ','ぞ':'ぼ',
                         'だ':'が','ぢ':'び','づ':'ぐ','で':'べ','ど':'ご',
                         'ば':'ざ','び':'ぢ','ぶ':'ず','べ':'ぜ','ぼ':'ど',

                         'ぱ':'ぷ','ぴ':'ぺ','ぷ':'ぱ','ぺ':'ぽ','ぽ':'ぴ'}

         "katakana" : {'ア':'ワ','イ':'ミ','ウ':'フ','エ':'ネ','オ':'ト',
                        'カ':'ア', 'キ':'チ','ク':'ル','ケ':'テ','コ':'ヨ',
                        'サ':'ラ','シ':'キ','ス':'ヌ','セ':'ヘ','ソ':'ホ',
                        'タ':'サ','チ':'ヒ','ツ':'ユ','テ':'セ','ト':'ソ',
                        'ナ':'ハ','ニ':'シ','ヌ':'ス','ネ':'メ','ノ':'オ',
                        'ハ':'マ','ヒ':'リ','フ':'ク','ヘ':'ケ','ホ':'ロ',
                        'マ':'ヤ','ミ':'イ','ム':'ツ','メ':'レ','モ':'コ',
                        'ヤ':'タ','ユ':'オ','ヨ':'モ',
                        'ラ':'ナ','リ':'ニ','ル':'ウ','レ':'エ','ロ':'ノ',
                        'ワ':'カ','オ':'ム','ン':'ン',

                        'ガ':'ダ','ギ':'ジ','グ':'ズ','ゲ':'デ','ゴ':'ゾ',
                        'ザ':'バ','ジ':'ゴ','ズ':'ブ','ゼ':'ゲ','ゾ':'ボ',
                        'ダ':'ガ','ジ':'ビ','ズ':'グ','デ':'ベ','ド':'ゴ',
                        'バ':'ザ','ビ':'ジ','ブ':'ズ','ベ':'ゼ','ボ':'ド',

                        'パ':'プ','ピ':'ペ','プ':'パ','ペ':'ポ','ポ':'ピ' }}

fanon = {"de": {"ä": "ÿ", "ë": "ä", "ï": "ë", "ö": "ü", "ü": "ï", "ÿ": "ö",
                "ß": "ç", "ç": "ß"}}
